paypal-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/paypal/executeApprovedPayPal.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.paypal.executeApprovedPayPal"> 
   <soapenv:Header/>
   <soapenv:Body>
      <urn:paypalApiUrl>https://api.sandbox.paypal.com</urn:paypalApiUrl>
      <urn:authorization>Bearer J2rIYYtGxmjEJGkHwf3tVEXpsjO9EsavwSZFSwfCaRI</urn:authorization>
      <urn:id>PAY-34629814WL663112AKEE3AWQ</urn:id>
      <urn:payerid>7E7MGXCWTTKK2</urn:payerid>
   </soapenv:Body>
</soapenv:Envelope>
